app/Controllers/Auth.php

    public function login()
    {
        try {
            $data = $this->request->getJSON(true) ?? $this->request->getPost();

            $model = new \App\Models\UsuarioModel();
            $user = $model->where('email', $data['email'])->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'chicho@gmail.com'
 LIMIT 1