app/Controllers/CatalogoController.php

            $builder->where('precio_base <=', $filtros['precio_max']);
        }

        $data['productos'] = $builder->get()->getResultArray();
        $data['filtros'] = $filtros;

        // Obtener valores únicos para los selectores
        $data['marcas'] = $productoModel->distinct()->select('nombre')->findAll();
        $data['anios'] = $productoModel->distinct()->select('anio')->orderBy('anio', 'DESC')->findAll();
        $data['transmisiones'] = $productoModel->distinct()->select('transmision')->findAll();
---
SELECT *
FROM `productos`
SELECT DISTINCT `nombre`
FROM `productos`
SELECT DISTINCT `anio`
FROM `productos`
ORDER BY `anio` DESC
SELECT DISTINCT `transmision`
FROM `productos`

    public function vehiculo($id)
    {
        $productoModel = new ProductoModel();
        $data['vehiculo'] = $productoModel->find($id);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '2'