app/Controllers/CatalogoController.php

        }

        // Obtener datos para filtros
        $data = [
            'productos' => $productoModel->paginate($perPage),
            'pager' => $productoModel->pager,
            'filtros' => $filtros,
            'marcas_disponibles' => $marcaModel->where('estado', 1)->findAll(),
            'anios' => $productoModel->select('anio')->distinct()->orderBy('anio', 'DESC')->findAll(),
            'transmisiones' => $productoModel->select('transmision')->distinct()->findAll()
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `estado` = 1
AND `marca` = 'Fiat'
SELECT DISTINCT `anio`
FROM `productos`
ORDER BY `anio` DESC