app/Controllers/Consultas.php

UPDATE `consultas` SET `atendida` = 1
WHERE `consultas`.`id` IN ('1')
---
    public function marcar_atendida($id)
    {
        $this->consultaModel->update($id, ['atendida' => 1]);