app/Controllers/UsuarioController.php

SELECT *
FROM `usuarios`
WHERE   (
`nombre` LIKE '%12345@outlook.es%' ESCAPE '!'
OR  `apellido` LIKE '%12345@outlook.es%' ESCAPE '!'
OR  `email` LIKE '%12345@outlook.es%' ESCAPE '!'
 )
ORDER BY `id` DESC
SELECT *
FROM `usuarios`
ORDER BY `id` DESC
SELECT *
FROM `cita_clientes`
ORDER BY `fecha_creacion` DESC
SELECT *
FROM `consultas`
ORDER BY `atendida` ASC, `fecha` DESC
---
    public function index()
{
    $buscar = $this->request->getGet('buscar');

    if ($buscar) {
        $usuarios = $this->usuarioModel
            ->groupStart()
                ->like('nombre', $buscar)
                ->orLike('apellido', $buscar)
                ->orLike('email', $buscar)
            ->groupEnd()
            ->orderBy('id', 'DESC')
            ->findAll();
    } else {
        $usuarios = $this->usuarioModel
            ->orderBy('id', 'DESC')
            ->findAll();
    }

    // Resto de los modelos
    $citaModel = new \App\Models\CitaClienteModel();
    $citas = $citaModel->orderBy('fecha_creacion', 'DESC')->findAll();

    $consultaModel = new \App\Models\ConsultaModel();
    $consultas = $consultaModel
        ->orderBy('atendida', 'ASC')
        ->orderBy('fecha', 'DESC')
        ->findAll();

UPDATE `usuarios` SET `estado` = 0, `updated_at` = '2025-06-11 19:11:40'
WHERE `usuarios`.`id` IN ('14')
---
    public function deshabilitar($id)
    {
        $this->usuarioModel->update($id, ['estado' => 0]);